shariltumin/esp32-cam-micropython/esp32-cam-1-11-571/boards/GENERIC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32 module (camera)"
#define MICROPY_HW_MCU_NAME "ESP32"
